{
  "id": "5.6.1",
  "title": "功能描述",
  "text": "系统管理模块提供系统运维和配置功能，包括用户管理、权限配置、敏感词维护、统计分析、文件管理、系统日志等。用户管理功能支持查看所有用户，重置密码，禁用/启用账户，分配角色。权限配置定义角色和权限的对应关系，采用RBAC模型。敏感词维护功能支持敏感词的新增、修改、删除、启用/禁用，分类管理（违法、色情、广告、其他）。统计分析功能展示系统运营数据，包括用户数趋势、评价数趋势、投诉处理率、菜品评分排行、热门档口等，使用ECharts图表可视化。文件管理功能查看和清理上传的图片文件。系统日志记录关键操作（登录、数据修改、异常等），支持按用户、时间、操作类型查询。该模块仅系统管理员可访问。",
  "word_limit": 300,
  "imagePath": "${flow}/flow-system-admin.png",
  "content": "系统管理模块是面向系统管理员的高级管理功能集合，提供了系统运维、配置管理、数据统计、日志审计等功能，是保障系统稳定运行和持续优化的重要支撑模块。该模块仅限系统管理员角色访问，通过@PreAuthorize(\"hasRole('SYSTEM_ADMIN')\")注解进行权限控制，确保系统关键功能的安全性。\n\n在用户管理功能中，系统管理员可以查看系统中的所有用户账号，包括普通用户、食堂管理员和其他系统管理员。用户列表展示用户的基本信息，如用户名、昵称、邮箱、角色、状态、注册时间等。管理员可以通过搜索框按用户名或昵称进行模糊查询，可以按角色和状态进行筛选，支持分页浏览。对于存在问题的用户，管理员可以执行禁用操作，将用户状态设置为禁用，禁用的用户无法登录系统；当问题解决后，可以重新启用账户。对于忘记密码的用户，管理员可以执行重置密码操作，将密码重置为系统默认密码，用户使用默认密码登录后需要强制修改密码。管理员还可以为用户分配或修改角色，如将普通用户提升为食堂管理员，或取消某个食堂管理员的管理权限。\n\n在权限配置功能中，系统采用基于角色的访问控制（RBAC）模型。系统预定义了三种角色：普通用户（USER）具有浏览菜品和提交评价投诉的权限；食堂管理员（CANTEEN_ADMIN）除了普通用户权限外，还具有管理食堂、档口、菜品信息，查看和处理评价投诉的权限；系统管理员（SYSTEM_ADMIN）拥有最高权限，可以执行用户管理、权限配置、敏感词维护等所有管理操作。权限配置界面展示角色与权限的对应关系矩阵，管理员可以调整角色的权限范围，权限的粒度细化到具体的功能模块和操作类型（查看、新增、修改、删除）。\n\n在敏感词维护功能中，系统管理员可以对敏感词库进行维护，保证评价内容审核的准确性。敏感词管理界面支持敏感词的新增、修改、删除、启用和禁用操作。敏感词按类型进行分类管理，包括违法类（涉及违法犯罪的词汇）、色情类（涉及色情内容的词汇）、广告类（广告推广相关词汇）、侮辱类（侮辱性语言）、其他类。每个敏感词可以单独设置是否启用，禁用的敏感词不参与内容检测。敏感词库的更新会实时生效，系统使用缓存技术（如Redis或本地缓存）存储敏感词列表，当敏感词库更新时，清除缓存重新加载，确保检测逻辑使用最新的敏感词数据。\n\n在统计分析功能中，系统提供了多维度的数据统计和可视化展示，帮助管理者了解系统运营状况和发现潜在问题。用户数趋势统计按日期统计每天的新增用户数和累计用户数，使用折线图展示用户增长趋势。评价数趋势统计每天的评价提交数量，分析用户活跃度变化。投诉处理率统计待处理、处理中、已处理三种状态的投诉数量和占比，使用饼图展示，评估管理响应效率。菜品评分排行统计平均评分最高的Top 10菜品和评分最低的Bottom 10菜品，使用柱状图展示，帮助管理者了解受欢迎菜品和需要改进的菜品。热门档口统计根据档口下菜品的总评价数排名，识别最受关注的档口。这些统计数据支持按时间范围筛选（最近7天、最近30天、自定义时间段），提供多种视角的数据分析。\n\n在文件管理功能中，管理员可以查看系统中上传的所有图片文件列表，包括文件名、大小、上传时间、关联对象（食堂、档口、菜品、评价等）。对于无用的图片文件，管理员可以执行清理操作，释放服务器存储空间。系统提供文件存储统计，展示总文件数量、总占用空间、各类型文件占比等信息。\n\n在系统日志功能中，系统自动记录用户的关键操作和系统异常信息。日志内容包括操作时间、操作用户、操作类型（登录、新增、修改、删除等）、操作对象（如修改了哪个菜品）、操作参数、操作结果（成功或失败）、IP地址等。管理员可以通过日志查询界面，按用户筛选某个用户的所有操作记录，按时间范围查询某个时间段的日志，按操作类型筛选特定操作，按关键词搜索日志内容。日志查询支持分页显示，日志记录按时间倒序排列。日志功能对于问题追踪、安全审计、用户行为分析具有重要价值。\n\n该模块的功能流程如图所示，展示了系统管理员的典型操作流程，包括用户管理、权限配置、敏感词维护、统计分析等功能的使用场景。"
}