{
  "id": "6.3",
  "title": "系统安全性测试",
  "text": "系统安全性测试验证系统的安全防护措施是否有效。测试内容包括：（1）身份认证安全：测试密码加密存储（BCrypt）、JWT令牌签名验证、令牌过期处理、登录失败限制等；（2）授权安全：测试基于角色的权限控制，验证无权限用户访问受保护接口被拒绝；（3）SQL注入防护：使用预编译语句测试，验证系统对恶意SQL输入的防护；（4）XSS攻击防护：测试输入脚本标签是否被转义，验证前端对用户输入的处理；（5）CSRF防护：验证POST请求的CSRF Token验证机制；（6）文件上传安全：测试上传恶意文件（exe、bat、sh等）是否被拦截，验证文件类型和大小限制。测试结果表明系统具备基本的安全防护能力，未发现严重安全漏洞。建议后续增加HTTPS加密传输、接口限流、防重放攻击等措施进一步提升安全性。",
  "word_limit": 350,
  "content": "系统安全性测试是验证系统安全防护措施是否有效的关键环节，对于保护用户数据安全和系统稳定运行具有重要意义。本系统的安全性测试主要从身份认证安全、授权安全、数据安全和常见Web攻击防护等几个方面进行。\n\n在身份认证安全测试中，首先验证了密码加密存储机制。直接查询数据库user表的password字段，确认存储的是BCrypt加密后的哈希值（60字符长度的字符串），而非明文密码，符合安全要求。测试了相同密码多次加密的结果不同，验证了BCrypt的自适应特性，有效防止了彩虹表攻击。其次验证了JWT令牌的签名机制，尝试修改令牌的Payload部分（如修改用户ID或角色），使用修改后的令牌访问接口，系统正确识别签名无效并返回401错误，验证了签名验证的有效性。测试了令牌过期处理，使用已过期的令牌访问接口，系统返回401错误并提示令牌已过期，要求重新登录。再次验证了登录失败限制机制，连续5次输入错误密码后，账户被临时锁定30分钟，在锁定期间即使输入正确密码也无法登录，提示账户已锁定，有效防止了暴力破解攻击。\n\n在授权安全测试中，验证了基于角色的权限控制（RBAC）的有效性。使用普通用户的JWT令牌访问管理员接口（如/api/admin/user），系统返回403禁止访问错误，验证了权限控制生效。测试了跨角色访问，食堂管理员无法访问系统管理员的接口，系统管理员可以访问所有接口，权限层级正确。验证了方法级权限控制，标注了@PreAuthorize注解的方法在执行前正确进行了权限判断。测试了权限判断的性能，权限检查逻辑不应显著影响接口响应时间，实测权限判断耗时小于1毫秒，对性能影响可忽略。\n\n在SQL注入防护测试中，构造恶意SQL语句尝试注入系统。在登录接口的用户名字段输入\"admin' OR '1'='1\"，期望绕过密码验证，系统正确地将整个输入作为用户名进行查询，未执行注入的SQL代码，查询结果为空，登录失败。在搜索功能中输入\"'; DROP TABLE user; --\"，系统使用MyBatis Plus的参数化查询，将输入作为参数绑定，未执行DROP TABLE命令，验证了SQL注入防护有效。查看MyBatis Plus生成的SQL日志，确认使用了预编译语句（PreparedStatement），参数使用问号占位符，从根本上防止了SQL注入。\n\n在XSS攻击防护测试中，测试了系统对脚本代码的处理。在评价内容中输入\"<script>alert('XSS')</script>\"，提交评价后查看页面源代码，脚本标签被转义为\"&lt;script&gt;alert('XSS')&lt;/script&gt;\"，在页面上以文本形式显示而非执行，验证了XSS防护有效。测试了HTML标签的转义，输入\"<img src=x onerror=alert('XSS')>\"，系统正确转义了标签，未执行脚本。前端使用Vue 3的双花括号语法{{ }}输出数据，Vue自动进行HTML转义，防止了XSS攻击。对于富文本内容，如果未来需要支持，应使用DOMPurify等库进行白名单过滤，而非简单的转义。\n\n在CSRF攻击防护测试中，由于本系统采用JWT令牌进行认证，不依赖Cookie和Session，天然不存在CSRF风险。JWT令牌存储在localStorage中，不会被第三方网站的请求自动携带，CSRF攻击无法生效。为了进一步验证，构造一个第三方页面，尝试发送POST请求到系统的接口，由于请求头中没有JWT令牌，系统返回401未授权错误，请求被拒绝，验证了CSRF防护有效。\n\n在文件上传安全测试中，测试了文件类型和大小的限制。尝试上传可执行文件（.exe、.bat、.sh等），系统验证MIME类型，拒绝非图片格式文件的上传，返回错误提示。尝试上传超大文件（10MB），系统验证文件大小，拒绝上传并提示超过限制。尝试上传伪装成图片的脚本文件（修改扩展名），系统验证真实的MIME类型，识别出伪装并拒绝。测试了文件名的安全处理，系统使用UUID生成唯一文件名，避免了文件名冲突和路径遍历攻击。\n\n测试结果表明，系统在身份认证、授权控制、数据保护、常见Web攻击防护等方面具备基本的安全防护能力，未发现严重的安全漏洞。但系统仍有进一步提升安全性的空间，建议后续增加以下安全措施：使用HTTPS协议加密传输，防止中间人攻击和数据窃听；实现接口限流机制，防止恶意用户频繁请求导致服务不可用；增加防重放攻击机制，为关键接口添加请求唯一标识和时间戳验证；定期进行安全审计和漏洞扫描，及时发现和修复潜在的安全风险。"
}