{
  "id": "5.4.1",
  "title": "功能描述",
  "text": "评价管理模块是系统的核心业务模块，负责处理用户对菜品的评价和评分。该模块实现了评价提交、敏感词过滤、评价审核、评分统计、评价展示等功能。用户在菜品详情页可提交1-5星评分和文字评价，可上传评价图片（最多3张）。系统对评价内容进行敏感词检测，包含敏感词的评价进入待审核状态，管理员审核通过后才对外展示。评价提交后实时更新菜品平均分和评价数。用户可查看自己的评价历史，修改或删除评价。管理员可查看所有评价，进行审核、隐藏、删除操作。支持按菜品、按用户、按时间范围、按评分筛选评价。该模块的核心流程包括：用户浏览菜品，点击评价按钮，选择评分星级，填写评价内容，上传图片（可选），提交后系统进行敏感词检测，通过检测的评价立即展示，否则进入待审核队列。",
  "word_limit": 300,
  "imagePath": "${flow}/flow-rating.png",
  "content": "评价管理模块是食堂评价系统的核心业务模块，承载着收集用户反馈、展示菜品口碑、指导用户选择的重要功能。该模块通过科学的评价机制和智能的内容审核，为食堂服务质量的提升提供了数据基础。\n\n在评价提交功能中，用户可以对已浏览或消费过的菜品进行评价。评价包括两部分：星级评分和文字评论。星级评分采用1-5星制，1星表示非常不满意，5星表示非常满意，用户通过点击星星图标快速选择评分。文字评论允许用户详细描述菜品的口感、分量、卫生等方面的感受，字数限制为500字以内。为了增强评价的可信度，系统支持上传评价图片，用户最多可以上传3张图片，展示菜品的实际外观、分量等，图片大小限制为2MB以内，格式支持JPG、PNG等常见图片格式。\n\n在评价内容审核功能中，为了维护良好的社区氛围和防止不当言论传播，系统对用户提交的评价内容进行敏感词检测。系统维护一个敏感词库，包括政治敏感词、暴力词汇、侮辱性语言等。当用户提交评价时，系统自动对评价内容进行敏感词匹配，采用DFA（确定性有限自动机）算法实现高效的多模式匹配，检测速度快，对用户体验影响小。如果评价内容包含敏感词，评价的状态将被设置为"待审核"，不会立即对外展示，而是进入管理员的审核队列。管理员查看待审核评价，判断是否存在实质性问题，可以选择通过（评价变为已发布状态）或拒绝（评价被删除）。如果评价内容未包含敏感词，评价提交后立即发布，状态设置为"已发布"，对所有用户可见。\n\n在评分统计功能中，系统实时维护每个菜品的平均评分和评价总数。当用户提交评价后，系统触发评分统计逻辑，查询该菜品的所有评价记录，计算平均评分（AVG函数）和评价数量（COUNT函数），更新dish表中的avg_score和rating_count字段。这两个统计字段在菜品列表和详情页中展示，帮助其他用户快速了解菜品的总体口碑。平均评分保留一位小数，评价数量显示为整数，如"4.5分（128条评价）"。\n\n在评价展示功能中，用户可以从多个入口查看评价信息。在菜品详情页，展示该菜品的所有评价，按提交时间倒序排列，最新的评价显示在最前面。每条评价显示评价用户的头像、昵称、评分星级、评价时间、评价内容和图片（如果有）。用户可以点击图片查看大图，方便查看菜品细节。在个人中心，用户可以查看自己提交的所有评价历史，可以编辑或删除自己的评价。编辑评价可以修改评分和评价内容，删除评价会将评价状态标记为已删除（逻辑删除），同时触发菜品评分的重新统计。\n\n在管理员评价管理功能中，管理员具有查看所有评价的权限。管理员可以按菜品筛选评价，查看特定菜品的所有评价；可以按用户筛选，查看特定用户的评价历史；可以按时间范围筛选，查看某个时间段内的评价；可以按评分筛选，重点关注低评分评价以发现问题；可以按状态筛选，处理待审核的评价。对于恶意评价或虚假评价，管理员可以执行隐藏或删除操作，被删除的评价不再显示，且不计入评分统计。\n\n该模块的核心业务流程如下：用户在浏览菜品时，点击菜品卡片进入详情页，查看菜品信息和其他用户的评价。如果用户想要提交评价，点击评价按钮，弹出评价提交对话框。用户首先选择评分星级，然后在文本框中输入评价内容，描述自己对菜品的真实感受。如果需要，可以点击图片上传按钮，从相册中选择菜品照片上传（最多3张）。填写完成后，点击提交按钮，前端将评价数据发送到后端。后端接收评价数据，进行敏感词检测，如果通过检测，评价立即发布并展示在菜品详情页，同时更新菜品的平均分和评价数；如果未通过检测，评价进入待审核状态，系统提示用户评价正在审核中。评价成功提交后，对话框关闭，详情页刷新显示最新评价。该模块的核心流程如图所示，清晰展示了从评价提交到审核再到展示的完整过程。"
}