{
  "id": "4.3.1",
  "title": "数据流图",
  "text": "数据流图（Data Flow Diagram，DFD）是一种图形化工具，用于描述数据在系统中的流动和处理过程。本系统采用分层数据流图，顶层（0层）展示系统整体的输入输出和主要处理过程，二层数据流图展示各功能模块内部的详细数据流转。下面按功能模块展示各模块的二层数据流图。",
  "word_limit": 150,
  "content": "数据流图（Data Flow Diagram，简称DFD）是一种图形化的系统模型，用于描述数据在信息系统中的流动和处理过程。数据流图由数据流、处理过程、数据存储和外部实体四种基本元素组成，通过这些元素的组合，可以清晰地表达系统的功能和数据流转逻辑。\n\n数据流图具有分层结构，可以从不同的抽象层次描述系统。顶层数据流图（0层DFD）展示系统的整体输入输出和主要处理过程，给出系统的宏观视图。一层数据流图将顶层的处理过程进一步分解，展示各个子系统或功能模块。二层数据流图对一层DFD中的处理过程进行更详细的分解，展示功能模块内部的数据处理细节。\n\n本系统采用分层数据流图进行设计。顶层DFD展示了用户、管理员等外部实体与系统的交互，以及系统的主要处理过程，如用户认证、信息管理、评价管理、投诉管理等。一层DFD将系统分解为六个功能模块，对应前面的系统模块划分。二层DFD对每个功能模块内部的数据流进行详细描述，展示模块内部的数据处理逻辑和数据存储操作。\n\n下面按功能模块展示各模块的二层数据流图，详细说明系统各功能模块内部的数据流动和处理过程。",
  "items": [
    {
      "title": "用户认证与权限管理功能2层数据流图",
      "text": "展示用户登录认证、JWT令牌生成和验证、角色权限检查的数据流程。用户提交用户名密码，系统验证后生成JWT令牌返回前端，前端携带令牌访问受保护接口，后端验证令牌有效性并提取用户信息进行权限判断。",
      "word_limit": 100,
      "imagePath": "${dfd}/dfd-auth-level2.png"
    },
    {
      "title": "食堂与档口管理功能2层数据流图",
      "text": "展示食堂档口信息的增删改查数据流程。管理员通过前端界面提交食堂或档口信息，后端接收数据进行校验，通过Service层处理业务逻辑，调用Mapper层操作数据库，返回处理结果给前端显示。包括食堂列表查询、档口关联查询等操作。",
      "word_limit": 100,
      "imagePath": "${dfd}/dfd-canteen-stall-level2.png"
    },
    {
      "title": "菜品管理功能2层数据流图",
      "text": "展示菜品信息管理的数据流程，包括菜品新增、修改、删除、上下架、图片上传等操作。管理员提交菜品信息和图片，系统处理图片上传到服务器，保存菜品信息到数据库，支持按档口查询菜品列表、按分类筛选、按状态过滤等。",
      "word_limit": 100,
      "imagePath": "${dfd}/dfd-dish-level2.png"
    },
    {
      "title": "评价管理功能2层数据流图",
      "text": "展示用户评价提交和管理的数据流程。用户选择菜品提交评分和评价内容，系统进行敏感词过滤，保存评价到数据库，计算菜品平均分。管理员可查看所有评价，进行审核操作，用户可查看自己的评价历史。支持按菜品、按用户、按时间范围查询评价。",
      "word_limit": 100,
      "imagePath": "${dfd}/dfd-rating-level2.png"
    },
    {
      "title": "投诉管理功能2层数据流图",
      "text": "展示投诉提交和处理的数据流程。用户提交投诉内容和图片，系统保存投诉信息到数据库，管理员查看投诉列表，选择投诉进行处理，填写处理结果，更新投诉状态为已处理。用户可查看自己的投诉历史和处理结果。支持按状态、按类型筛选投诉。",
      "word_limit": 100,
      "imagePath": "${dfd}/dfd-complaint-level2.png"
    }
  ],
  "docx_type": "subsection_title",
  "docx_type_text": "body_text",
  "docx_type_desc": "body_text"
}