{
  "id": "5.1.1",
  "title": "功能描述",
  "text": "用户认证与权限管理模块是系统的安全基础，负责用户身份验证和访问控制。该模块实现了用户注册、登录、JWT令牌生成和验证、基于角色的权限管理（RBAC）等功能。用户通过用户名密码登录，系统验证通过后生成JWT令牌返回前端，前端在后续请求中携带令牌访问受保护接口。后端通过JwtAuthenticationFilter拦截请求，验证令牌有效性，提取用户信息并存入SecurityContext。系统定义了普通用户、食堂管理员、系统管理员三种角色，通过@PreAuthorize注解实现方法级权限控制。密码使用BCrypt算法加密存储，登录失败次数超限后锁定账户。该模块的核心流程包括注册验证、登录认证、令牌刷新、权限判断等，为整个系统提供了安全保障。",
  "word_limit": 300,
  "imagePath": "${flow}/flow-auth.png",
  "content": "用户认证与权限管理模块是整个系统的安全基石，负责验证用户身份和控制用户对系统资源的访问权限。该模块的核心功能包括用户注册、用户登录、JWT令牌的生成与验证、基于角色的访问控制（RBAC）等，为系统的其他功能模块提供了安全保障。\n\n在用户注册功能中，新用户需要填写用户名、密码、邮箱等基本信息。系统对用户输入进行校验，检查用户名是否已存在、密码强度是否符合要求、邮箱格式是否正确等。验证通过后，系统使用BCrypt算法对用户密码进行加密，BCrypt是一种单向哈希算法，具有自适应特性，即使相同的密码每次加密的结果也不同，有效防止了彩虹表攻击。加密后的密码存储到数据库中，绝不以明文形式保存密码，保障了用户信息安全。\n\n在用户登录功能中，用户通过用户名和密码进行身份认证。前端收集用户输入的用户名和密码，发送到后端的登录接口。后端从数据库中根据用户名查询用户信息，使用BCrypt的matches方法验证用户输入的密码与数据库中存储的加密密码是否匹配。验证通过后，系统生成JWT令牌（Token），将用户ID、用户名、角色等信息编码到令牌的Payload部分，设置令牌有效期为24小时，使用系统配置的密钥对令牌进行签名，最后将生成的JWT令牌返回给前端。前端接收到令牌后，将其存储在浏览器的localStorage中，在后续的每次HTTP请求中，通过Axios拦截器自动在请求头的Authorization字段中携带令牌（格式为\"Bearer {token}\"）。\n\n在令牌验证功能中，后端配置了自定义的JWT认证过滤器（JwtAuthenticationFilter），该过滤器拦截所有需要认证的请求。过滤器从请求头中提取JWT令牌，验证令牌的签名是否正确、是否在有效期内。验证通过后，解析令牌的Payload部分，提取用户ID和角色信息，从数据库加载完整的用户信息，构造Authentication对象并存入SecurityContext。这样，在Controller和Service层中就可以通过SecurityContextHolder获取当前登录用户的信息。如果令牌验证失败（如令牌过期、签名错误），系统返回401未授权错误，前端自动跳转到登录页面要求用户重新登录。\n\n在权限管理功能中，系统实现了基于角色的访问控制（RBAC）。系统预设了三种角色：普通用户（USER）、食堂管理员（CANTEEN_ADMIN）、系统管理员（SYSTEM_ADMIN）。不同角色具有不同的功能权限，如普通用户只能查看信息和提交评价，食堂管理员可以管理菜品和处理投诉，系统管理员拥有所有权限。权限控制通过Spring Security的@PreAuthorize注解实现，在Controller方法上标注所需的角色，如@PreAuthorize(\"hasRole('ADMIN')\")表示该方法只有管理员可以访问。Spring Security在方法执行前自动进行权限判断，如果当前用户角色不满足要求，返回403禁止访问错误。\n\n该模块还实现了一些安全增强功能。为防止暴力破解，系统记录登录失败次数，连续失败超过5次后临时锁定账户30分钟。为防止会话劫持，JWT令牌具有过期时间，超时后需要重新登录。为保护敏感操作，对删除数据、修改权限等操作记录审计日志。该模块的核心业务流程如图所示，清晰展示了从用户登录到令牌验证再到权限判断的完整过程，为整个系统提供了可靠的安全保障机制。",
  "docx_type": "subsection_title",
  "docx_type_text": "body_text",
  "docx_type_desc": "body_text"
}